const express = require('express');
const server = express();

server.use(express.json());
server.use(express.static('public'));
//вопрос зачем используют
// Тем не менее, путь, переданный в функцию express.static, указан относительно каталога, 
//из которого запускается процесс node. В случае запуска приложения Express из другого каталога, 
//безопаснее использовать абсолютный путь к каталогу для предоставления файлов:

// app.use('/static', express.static(__dirname + '/public'));

server.get ('/',(req,res) => {
   res.send('Хочу на море, но express! А хочешь стих? Открой /mare');
});

server.get ('/mare',(req,res) => {
   
   res.send(`Лучистые астры подарит
   И чёрных очей звездопад
   И старый знакомый сценарий,
   Где есть золотящийся сад.`);
});
server.get ('/img/dialogkote.jpg',(req,res) => {
   
   res.send(`dialogkote.jpg`)
});

server.listen(3000);
// лвл 1
//+  1. підіймаете експресс сервер і робите там пару роутів +

// лвл 2
// 1. віддаєте експресом джейсон
//+  2. віддаєте експресом файл +

// лвл 3
// 1. під'єднуете і робите приклад використання до експреса статік сервер

// лвл 4
// 1. під'єднуете і робите приклад використання до експреса шаблонізатора

